
## Plan Result (terraform/aws/orange-pi-images)

[CI link](https://github.com/boxp/arch/actions/runs/16405090184)


<pre><code>Plan: 15 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_role.github_actions_orangepi
  * aws_iam_role_policy.github_actions_orangepi_s3
  * aws_kms_alias.orange_pi_images
  * aws_kms_key.orange_pi_images
  * aws_s3_bucket.orange_pi_images
  * aws_s3_bucket.orange_pi_images_logs
  * aws_s3_bucket_lifecycle_configuration.orange_pi_images
  * aws_s3_bucket_logging.orange_pi_images
  * aws_s3_bucket_public_access_block.orange_pi_images
  * aws_s3_bucket_public_access_block.orange_pi_images_logs
  * aws_s3_bucket_server_side_encryption_configuration.orange_pi_images
  * aws_s3_bucket_versioning.orange_pi_images
  * aws_ssm_parameter.github_actions_role_arn
  * aws_ssm_parameter.orange_pi_bucket_name
  * random_id.bucket_suffix


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_role.github_actions_orangepi will be created
  + resource "aws_iam_role" "github_actions_orangepi" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-actions-orangepi-images"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.github_actions_orangepi_s3 will be created
  + resource "aws_iam_role_policy" "github_actions_orangepi_s3" {
      + id          = (known after apply)
      + name        = "orangepi-images-s3-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_kms_alias.orange_pi_images will be created
  + resource "aws_kms_alias" "orange_pi_images" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/orange-pi-images"
      + name_prefix    = (known after apply)
      + region         = "ap-northeast-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.orange_pi_images will be created
  + resource "aws_kms_key" "orange_pi_images" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for Orange Pi images S3 bucket"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "ap-northeast-1"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Name" = "orange-pi-images-key"
        }
      + tags_all                           = {
          + "Name" = "orange-pi-images-key"
        }
    }

  # aws_s3_bucket.orange_pi_images will be created
  + resource "aws_s3_bucket" "orange_pi_images" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.orange_pi_images_logs will be created
  + resource "aws_s3_bucket" "orange_pi_images_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.orange_pi_images will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "orange_pi_images" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-northeast-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "cleanup_old_versions"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }
        }
    }

  # aws_s3_bucket_logging.orange_pi_images will be created
  + resource "aws_s3_bucket_logging" "orange_pi_images" {
      + bucket        = (known after apply)
      + id            = (known after apply)
      + region        = "ap-northeast-1"
      + target_bucket = (known after apply)
      + target_prefix = "access-logs/"
    }

  # aws_s3_bucket_public_access_block.orange_pi_images will be created
  + resource "aws_s3_bucket_public_access_block" "orange_pi_images" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-northeast-1"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.orange_pi_images_logs will be created
  + resource "aws_s3_bucket_public_access_block" "orange_pi_images_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-northeast-1"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.orange_pi_images will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "orange_pi_images" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-1"

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.orange_pi_images will be created
  + resource "aws_s3_bucket_versioning" "orange_pi_images" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_ssm_parameter.github_actions_role_arn will be created
  + resource "aws_ssm_parameter" "github_actions_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arch/orange-pi/github-actions-role-arn"
      + region         = "ap-northeast-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.orange_pi_bucket_name will be created
  + resource "aws_ssm_parameter" "orange_pi_bucket_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arch/orange-pi/s3-bucket-name"
      + region         = "ap-northeast-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # random_id.bucket_suffix will be created
  + resource "random_id" "bucket_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + github_actions_role_arn  = (known after apply)
  + github_actions_role_name = "github-actions-orangepi-images"
  + s3_bucket_arn            = (known after apply)
  + s3_bucket_name           = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":4351,"Program":"tfcmt","SHA1":"a4d21696c7841ba9bb42fd65f34ac8d4c0cbca2c","Target":"terraform/aws/orange-pi-images","Vars":{},"WorkflowName":"pull_request_target"} -->